bassem-mostafa/GPIO_STM32L496VGT6P/GPIO_STM32L496VGT6P.c
// #############################################################################
// #### Copyright ##############################################################
// #############################################################################

/*
 * Copyright 2024 BaSSeM
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

// #############################################################################
// #### Description ############################################################
// #############################################################################

// #############################################################################
// #### Control Include(s) #####################################################
// #############################################################################

#include "Platform.h"

// #############################################################################
// #### Control Macro(s) #######################################################
// #############################################################################

#ifndef DEBUG
    #define DEBUG
#endif

#ifdef DEBUG
    #undef DEBUG
#endif

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#ifdef STM32L496xx

// #############################################################################
// #### Include(s) #############################################################
// #############################################################################

    #include "../../GPIO_Internal.h"
    #include "GPIO_STM32L496VGT6P.h"

    #include "stm32l4xx.h"

// #############################################################################
// #### Private Macro(s) #######################################################
// #############################################################################

// #############################################################################
// #### Private Type(s) ########################################################
// #############################################################################

typedef enum GPIO_STM32L496VGT6P_Event
{
    GPIO_STM32L496VGT6P_Event_None = 0,
    GPIO_STM32L496VGT6P_Event_ExternalInterrupt = UTIL_BIT( 0 ),
} GPIO_STM32L496VGT6P_Event_t;

typedef struct GPIO_STM32L496VGT6P_InstanceContext
{
    GPIO_TypeDef * GPIOx;
    GPIO_InitTypeDef InitType;
    GPIO_STM32L496VGT6P_Event_t Event;
} GPIO_STM32L496VGT6P_InstanceContext_t;

typedef struct GPIO_STM32L496VGT6P_Context
{
    TIM_Timestamp_t Timestamp;
    GPIO_STM32L496VGT6P_InstanceContext_t Context[ GPIO_STM32L496VGT6P_Count ];
} GPIO_STM32L496VGT6P_Context_t;

// #############################################################################
// #### Private Method(s) Prototype ############################################
// #############################################################################

void HAL_GPIO_EXTI_Callback( uint16_t GPIO_Pin );

void EXTI0_IRQHandler( void );
void EXTI1_IRQHandler( void );
void EXTI2_IRQHandler( void );
void EXTI3_IRQHandler( void );
void EXTI4_IRQHandler( void );
void EXTI9_5_IRQHandler( void );
void EXTI15_10_IRQHandler( void );

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Context_Initialize( void );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Context_Cycle( void );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Context_DeInitialize( void );

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Initialize( GPIO_STM32L496VGT6P_Instance_t * Instance );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Cycle( GPIO_STM32L496VGT6P_Instance_t * Instance );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_DeInitialize( GPIO_STM32L496VGT6P_Instance_t * Instance );

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Write( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Value_t Value );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Read( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Value_t * Value );

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetMode( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Mode_t Mode );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetPull( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Pull_t Pull );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetSpeed( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Speed_t Speed );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetFunction( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Function_t Function );
static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Commit( GPIO_STM32L496VGT6P_Instance_t * Instance );

// #############################################################################
// #### Private Variable(s) ####################################################
// #############################################################################

static GPIO_STM32L496VGT6P_Context_t GPIO_STM32L496VGT6P_Context;

// #############################################################################
// #### Private Method(s) ######################################################
// #############################################################################

void HAL_GPIO_EXTI_Callback( uint16_t GPIO_Pin )
{
    for ( GPIO_STM32L496VGT6P_t GPIO_x = GPIO_STM32L496VGT6P_1; GPIO_x < GPIO_STM32L496VGT6P_Count; ++GPIO_x )
    {
        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ GPIO_x ];
        GPIO_InitTypeDef * InitType = &Context->InitType;

        if ( InitType->Pin == GPIO_Pin
             && ( InitType->Mode == GPIO_MODE_IT_RISING
                  || InitType->Mode == GPIO_MODE_IT_FALLING
                  || InitType->Mode == GPIO_MODE_IT_RISING_FALLING ) )
        {
            Context->Event |= GPIO_STM32L496VGT6P_Event_ExternalInterrupt;
        }
    }
}

void EXTI0_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_0 );
}

void EXTI1_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_1 );
}

void EXTI2_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_2 );
}

void EXTI3_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_3 );
}

