bassem-mostafa/GPIO_STM32L496VGT6P/GPIO_STM32L496VGT6P.c
void EXTI4_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_4 );
}

void EXTI9_5_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_5 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_6 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_7 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_8 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_9 );
}

void EXTI15_10_IRQHandler( void )
{
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_10 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_11 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_12 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_13 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_14 );
    HAL_GPIO_EXTI_IRQHandler( GPIO_PIN_15 );
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Context_Initialize( void )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( void )", __FUNCTION__ );

        // FIXME Remove the usage of `MX_GPIO_Init()`
    #if 1
        extern void MX_GPIO_Init( void );
        MX_GPIO_Init( );
    #endif

        // TODO Enable All External Interrupts
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Context_Cycle( void )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( void )", __FUNCTION__ );
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Context_DeInitialize( void )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( void )", __FUNCTION__ );

        // TODO Disable All External Interrupts
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Initialize( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];
        GPIO_InitTypeDef * InitType = &Context->InitType;

        switch ( Instance->GPIOx )
        {
            case GPIO_STM32L496VGT6P_1:
            case GPIO_STM32L496VGT6P_2:
            case GPIO_STM32L496VGT6P_3:
            case GPIO_STM32L496VGT6P_4:
            case GPIO_STM32L496VGT6P_5:
                __HAL_RCC_GPIOE_CLK_ENABLE( );
                Context->GPIOx = GPIOE;
                InitType->Pin = GPIO_PIN_2 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_1 );
                break;

            case GPIO_STM32L496VGT6P_6:
                break;

            case GPIO_STM32L496VGT6P_7:
                __HAL_RCC_GPIOC_CLK_ENABLE( );
                Context->GPIOx = GPIOC;
                InitType->Pin = GPIO_PIN_13 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_7 );
                break;

            case GPIO_STM32L496VGT6P_8:
            case GPIO_STM32L496VGT6P_9:
            case GPIO_STM32L496VGT6P_10:
            case GPIO_STM32L496VGT6P_11:
            case GPIO_STM32L496VGT6P_12:
            case GPIO_STM32L496VGT6P_13:
            case GPIO_STM32L496VGT6P_14:
                break;

            case GPIO_STM32L496VGT6P_15:
            case GPIO_STM32L496VGT6P_16:
            case GPIO_STM32L496VGT6P_17:
            case GPIO_STM32L496VGT6P_18:
                __HAL_RCC_GPIOC_CLK_ENABLE( );
                Context->GPIOx = GPIOC;
                InitType->Pin = GPIO_PIN_0 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_15 );
                break;

            case GPIO_STM32L496VGT6P_19:
            case GPIO_STM32L496VGT6P_20:
            case GPIO_STM32L496VGT6P_21:
            case GPIO_STM32L496VGT6P_22:
                break;

            case GPIO_STM32L496VGT6P_23:
            case GPIO_STM32L496VGT6P_24:
            case GPIO_STM32L496VGT6P_25:
            case GPIO_STM32L496VGT6P_26:
                __HAL_RCC_GPIOA_CLK_ENABLE( );
                Context->GPIOx = GPIOA;
                InitType->Pin = GPIO_PIN_0 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_23 );
                break;

            case GPIO_STM32L496VGT6P_27:
            case GPIO_STM32L496VGT6P_28:
                break;

            case GPIO_STM32L496VGT6P_29:
            case GPIO_STM32L496VGT6P_30:
            case GPIO_STM32L496VGT6P_31:
            case GPIO_STM32L496VGT6P_32:
                __HAL_RCC_GPIOA_CLK_ENABLE( );
                Context->GPIOx = GPIOA;
                InitType->Pin = GPIO_PIN_4 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_29 );
                break;

            case GPIO_STM32L496VGT6P_33:
            case GPIO_STM32L496VGT6P_34:
                __HAL_RCC_GPIOC_CLK_ENABLE( );
                Context->GPIOx = GPIOC;
                InitType->Pin = GPIO_PIN_4 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_33 );
                break;

            case GPIO_STM32L496VGT6P_35:
            case GPIO_STM32L496VGT6P_36:
            case GPIO_STM32L496VGT6P_37:
                __HAL_RCC_GPIOB_CLK_ENABLE( );
                Context->GPIOx = GPIOB;
                InitType->Pin = GPIO_PIN_0 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_35 );
                break;

            case GPIO_STM32L496VGT6P_38:
            case GPIO_STM32L496VGT6P_39:
            case GPIO_STM32L496VGT6P_40:
            case GPIO_STM32L496VGT6P_41:
            case GPIO_STM32L496VGT6P_42:
            case GPIO_STM32L496VGT6P_43:
            case GPIO_STM32L496VGT6P_44:
            case GPIO_STM32L496VGT6P_45:
            case GPIO_STM32L496VGT6P_46:
                __HAL_RCC_GPIOE_CLK_ENABLE( );
                Context->GPIOx = GPIOE;
                InitType->Pin = GPIO_PIN_7 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_38 );
                break;

            case GPIO_STM32L496VGT6P_47:
                __HAL_RCC_GPIOB_CLK_ENABLE( );
                Context->GPIOx = GPIOB;
                InitType->Pin = GPIO_PIN_10 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_47 );
                break;

            case GPIO_STM32L496VGT6P_48:
            case GPIO_STM32L496VGT6P_49:
            case GPIO_STM32L496VGT6P_50:
                break;

            case GPIO_STM32L496VGT6P_51:
            case GPIO_STM32L496VGT6P_52:
            case GPIO_STM32L496VGT6P_53:
            case GPIO_STM32L496VGT6P_54:
                __HAL_RCC_GPIOB_CLK_ENABLE( );
                Context->GPIOx = GPIOB;
                InitType->Pin = GPIO_PIN_12 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_51 );
                break;

            case GPIO_STM32L496VGT6P_55:
            case GPIO_STM32L496VGT6P_56:
            case GPIO_STM32L496VGT6P_57:
            case GPIO_STM32L496VGT6P_58:
            case GPIO_STM32L496VGT6P_59:
            case GPIO_STM32L496VGT6P_60:
            case GPIO_STM32L496VGT6P_61:
            case GPIO_STM32L496VGT6P_62:
                __HAL_RCC_GPIOD_CLK_ENABLE( );
                Context->GPIOx = GPIOD;
                InitType->Pin = GPIO_PIN_8 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_55 );
                break;

            case GPIO_STM32L496VGT6P_63:
            case GPIO_STM32L496VGT6P_64:
            case GPIO_STM32L496VGT6P_65:
            case GPIO_STM32L496VGT6P_66:
                __HAL_RCC_GPIOC_CLK_ENABLE( );
                Context->GPIOx = GPIOC;
                InitType->Pin = GPIO_PIN_6 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_63 );
                break;

            case GPIO_STM32L496VGT6P_67:
            case GPIO_STM32L496VGT6P_68:
            case GPIO_STM32L496VGT6P_69:
                __HAL_RCC_GPIOA_CLK_ENABLE( );
                Context->GPIOx = GPIOA;
                InitType->Pin = GPIO_PIN_8 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_67 );
                break;

            case GPIO_STM32L496VGT6P_70:
            case GPIO_STM32L496VGT6P_71:
            case GPIO_STM32L496VGT6P_72:
            case GPIO_STM32L496VGT6P_73:
            case GPIO_STM32L496VGT6P_74:
            case GPIO_STM32L496VGT6P_75:
            case GPIO_STM32L496VGT6P_76:
                break;

            case GPIO_STM32L496VGT6P_77:
                __HAL_RCC_GPIOA_CLK_ENABLE( );
                Context->GPIOx = GPIOA;
                InitType->Pin = GPIO_PIN_15 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_77 );
                break;

            case GPIO_STM32L496VGT6P_78:
            case GPIO_STM32L496VGT6P_79:
            case GPIO_STM32L496VGT6P_80:
                __HAL_RCC_GPIOC_CLK_ENABLE( );
                Context->GPIOx = GPIOC;
                InitType->Pin = GPIO_PIN_10 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_78 );
                break;

            case GPIO_STM32L496VGT6P_81:
            case GPIO_STM32L496VGT6P_82:
            case GPIO_STM32L496VGT6P_83:
            case GPIO_STM32L496VGT6P_84:
            case GPIO_STM32L496VGT6P_85:
            case GPIO_STM32L496VGT6P_86:
            case GPIO_STM32L496VGT6P_87:
            case GPIO_STM32L496VGT6P_88:
                __HAL_RCC_GPIOD_CLK_ENABLE( );
                Context->GPIOx = GPIOD;
                InitType->Pin = GPIO_PIN_0 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_81 );
                break;

            case GPIO_STM32L496VGT6P_89:
            case GPIO_STM32L496VGT6P_90:
            case GPIO_STM32L496VGT6P_91:
            case GPIO_STM32L496VGT6P_92:
            case GPIO_STM32L496VGT6P_93:
                __HAL_RCC_GPIOB_CLK_ENABLE( );
                Context->GPIOx = GPIOB;
                InitType->Pin = GPIO_PIN_3 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_89 );
                break;

