bassem-mostafa/GPIO_STM32L496VGT6P/GPIO_STM32L496VGT6P.c
            case GPIO_STM32L496VGT6P_94:
                break;

            case GPIO_STM32L496VGT6P_95:
            case GPIO_STM32L496VGT6P_96:
                __HAL_RCC_GPIOB_CLK_ENABLE( );
                Context->GPIOx = GPIOB;
                InitType->Pin = GPIO_PIN_8 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_95 );
                break;

            case GPIO_STM32L496VGT6P_97:
                __HAL_RCC_GPIOE_CLK_ENABLE( );
                Context->GPIOx = GPIOE;
                InitType->Pin = GPIO_PIN_0 << ( Instance->GPIOx - GPIO_STM32L496VGT6P_97 );
                break;

            case GPIO_STM32L496VGT6P_98:
            case GPIO_STM32L496VGT6P_99:
            case GPIO_STM32L496VGT6P_100:
                break;

            default:
                Status = GPIO_STM32L496VGT6P_Status_NotSupported;
                break;
        }

        if ( Status != GPIO_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        // TODO Check the applicability of the following on special function IOs
        InitType->Mode = GPIO_MODE_ANALOG;
        InitType->Pull = GPIO_NOPULL;

        Instance->Context = Context;

        Status = GPIO_STM32L496VGT6P_Instance_Commit( Instance );
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Cycle( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];
        GPIO_STM32L496VGT6P_Event_t Event = Context->Event; // CAUTION: Has to copy events occurred at the early start of the cycle, so as to be cleared at the end of the cycle,
                                                            //          which let events occurs after that for the next cycle call

        if ( ( Event & GPIO_STM32L496VGT6P_Event_ExternalInterrupt ) == GPIO_STM32L496VGT6P_Event_ExternalInterrupt )
        {
            Context->Event &= ~GPIO_STM32L496VGT6P_Event_ExternalInterrupt;
            GPIO_Debug( "External Interrupt: Instance=%p, GPIO=%d", Instance, Instance->GPIOx );

            if ( Instance->OnInterrupt != NULL )
            {
                Instance->OnInterrupt( Instance );
            }
        }
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_DeInitialize( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        // TODO De-Initialize & Disable
        // TODO Apply Lowest Power Mode
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Write( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Value_t Value )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Value=%d )", __FUNCTION__, Instance, Value );

        if ( Instance == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        if ( Context->GPIOx != NULL )
        {
            HAL_GPIO_WritePin( Context->GPIOx, Context->InitType.Pin, Value );
        }
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Read( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Value_t * Value )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Value=%p )", __FUNCTION__, Instance, Value );

        if ( Instance == NULL || Value == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        if ( Context->GPIOx != NULL )
        {
            *Value = HAL_GPIO_ReadPin( Context->GPIOx, Context->InitType.Pin );
        }
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetMode( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Mode_t Mode )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Mode=%d )", __FUNCTION__, Instance, Mode );

        if ( Instance == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        switch ( Mode )
        {
            case GPIO_STM32L496VGT6P_Mode_Input:
                Context->InitType.Mode = GPIO_MODE_INPUT;
                break;

            case GPIO_STM32L496VGT6P_Mode_Output:
                Context->InitType.Mode = GPIO_MODE_OUTPUT_PP;
                break;

            case GPIO_STM32L496VGT6P_Mode_OutputOpenDrain:
                Context->InitType.Mode = GPIO_MODE_OUTPUT_OD;
                break;

            case GPIO_STM32L496VGT6P_Mode_Interrupt:
                Context->InitType.Mode = GPIO_MODE_IT_RISING_FALLING;
                break;

            case GPIO_STM32L496VGT6P_Mode_InterruptRising:
                Context->InitType.Mode = GPIO_MODE_IT_RISING;
                break;

            case GPIO_STM32L496VGT6P_Mode_InterruptFalling:
                Context->InitType.Mode = GPIO_MODE_IT_FALLING;
                break;

            case GPIO_STM32L496VGT6P_Mode_Event:
                Context->InitType.Mode = GPIO_MODE_EVT_RISING_FALLING;
                break;

            case GPIO_STM32L496VGT6P_Mode_EventRising:
                Context->InitType.Mode = GPIO_MODE_EVT_RISING;
                break;

            case GPIO_STM32L496VGT6P_Mode_EventFalling:
                Context->InitType.Mode = GPIO_MODE_EVT_FALLING;
                break;

            case GPIO_STM32L496VGT6P_Mode_Alternate:
                Context->InitType.Mode = GPIO_MODE_AF_PP;
                break;

            case GPIO_STM32L496VGT6P_Mode_AlternateOpenDrain:
                Context->InitType.Mode = GPIO_MODE_AF_OD;
                break;

            case GPIO_STM32L496VGT6P_Mode_Analog:
                Context->InitType.Mode = GPIO_MODE_ANALOG;
                break;

            case GPIO_STM32L496VGT6P_Mode_AnalogADC:
                Context->InitType.Mode = GPIO_MODE_ANALOG_ADC_CONTROL;
                break;

            default:
                Status = GPIO_STM32L496VGT6P_Status_NotSupported;
                break;
        }
    }
    while ( 0 );

