bassem-mostafa/GPIO_STM32L496VGT6P/GPIO_STM32L496VGT6P.c
    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetPull( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Pull_t Pull )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Pull=%d )", __FUNCTION__, Instance, Pull );

        if ( Instance == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        switch ( Pull )
        {
            case GPIO_STM32L496VGT6P_Pull_None:
                Context->InitType.Pull = GPIO_NOPULL;
                break;

            case GPIO_STM32L496VGT6P_Pull_Up:
                Context->InitType.Pull = GPIO_PULLUP;
                break;

            case GPIO_STM32L496VGT6P_Pull_Down:
                Context->InitType.Pull = GPIO_PULLDOWN;
                break;

            default:
                Status = GPIO_STM32L496VGT6P_Status_NotSupported;
                break;
        }
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetSpeed( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Speed_t Speed )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Speed=%d )", __FUNCTION__, Instance, Speed );

        if ( Instance == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        switch ( Speed )
        {
            case GPIO_STM32L496VGT6P_Speed_Low:
                Context->InitType.Speed = GPIO_SPEED_FREQ_LOW;
                break;

            case GPIO_STM32L496VGT6P_Speed_Medium:
                Context->InitType.Speed = GPIO_SPEED_FREQ_MEDIUM;
                break;

            case GPIO_STM32L496VGT6P_Speed_High:
                Context->InitType.Speed = GPIO_SPEED_FREQ_HIGH;
                break;

            case GPIO_STM32L496VGT6P_Speed_VeryHigh:
                Context->InitType.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                break;

            default:
                Status = GPIO_STM32L496VGT6P_Status_NotSupported;
                break;
        }
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_SetFunction( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Function_t Function )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Function=%d )", __FUNCTION__, Instance, Function );

        if ( Instance == NULL )
        {
            Status = GPIO_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        switch ( Function )
        {
            case GPIO_STM32L496VGT6P_Function_0:
            case GPIO_STM32L496VGT6P_Function_1:
            case GPIO_STM32L496VGT6P_Function_2:
            case GPIO_STM32L496VGT6P_Function_3:
            case GPIO_STM32L496VGT6P_Function_4:
            case GPIO_STM32L496VGT6P_Function_5:
            case GPIO_STM32L496VGT6P_Function_6:
            case GPIO_STM32L496VGT6P_Function_7:
            case GPIO_STM32L496VGT6P_Function_8:
            case GPIO_STM32L496VGT6P_Function_9:
            case GPIO_STM32L496VGT6P_Function_10:
            case GPIO_STM32L496VGT6P_Function_11:
            case GPIO_STM32L496VGT6P_Function_12:
            case GPIO_STM32L496VGT6P_Function_13:
            case GPIO_STM32L496VGT6P_Function_14:
            case GPIO_STM32L496VGT6P_Function_15:
                // TODO Verify Alternate Function Application
                break;

            default:
                Status = GPIO_STM32L496VGT6P_Status_NotSupported;
                break;
        }
        if ( Status != GPIO_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Context->InitType.Alternate = Function;
    }
    while ( 0 );

    return Status;
}

static GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Instance_Commit( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        GPIO_STM32L496VGT6P_InstanceContext_t * Context = &GPIO_STM32L496VGT6P_Context.Context[ Instance->GPIOx ];

        if ( Context->GPIOx != NULL )
        {
            HAL_GPIO_Init( Context->GPIOx, &Context->InitType );
        }
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Method(s) #######################################################
// #############################################################################

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Initialize( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( ( Status = GPIO_STM32L496VGT6P_Context_Initialize( ) ) != GPIO_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Status = GPIO_STM32L496VGT6P_Instance_Initialize( Instance );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Cycle( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( ( Status = GPIO_STM32L496VGT6P_Context_Cycle( ) ) != GPIO_STM32L496VGT6P_Status_Success )
        {
            break;
        }

