bassem-mostafa/GPIO_STM32L496VGT6P/GPIO_STM32L496VGT6P.c
        Status = GPIO_STM32L496VGT6P_Instance_Cycle( Instance );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_DeInitialize( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( ( Status = GPIO_STM32L496VGT6P_Instance_DeInitialize( Instance ) ) != GPIO_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Status = GPIO_STM32L496VGT6P_Context_DeInitialize( );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_SetMode( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Mode_t Mode )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Mode=%d )", __FUNCTION__, Instance, Mode );

        Status = GPIO_STM32L496VGT6P_Instance_SetMode( Instance, Mode );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_SetPull( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Pull_t Pull )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Pull=%d )", __FUNCTION__, Instance, Pull );

        Status = GPIO_STM32L496VGT6P_Instance_SetPull( Instance, Pull );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_SetSpeed( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Speed_t Speed )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Speed=%d )", __FUNCTION__, Instance, Speed );

        Status = GPIO_STM32L496VGT6P_Instance_SetSpeed( Instance, Speed );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_SetFunction( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Function_t Function )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Function=%d )", __FUNCTION__, Instance, Function );

        Status = GPIO_STM32L496VGT6P_Instance_SetFunction( Instance, Function );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Commit( GPIO_STM32L496VGT6P_Instance_t * Instance )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        Status = GPIO_STM32L496VGT6P_Instance_Commit( Instance );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Write( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Value_t Value )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Value=%d )", __FUNCTION__, Instance, Value );

        Status = GPIO_STM32L496VGT6P_Instance_Write( Instance, Value );
    }
    while ( 0 );

    return Status;
}

GPIO_STM32L496VGT6P_Status_t GPIO_STM32L496VGT6P_Read( GPIO_STM32L496VGT6P_Instance_t * Instance, GPIO_STM32L496VGT6P_Value_t * Value )
{
    GPIO_STM32L496VGT6P_Status_t Status = GPIO_STM32L496VGT6P_Status_Success;

    do
    {
        GPIO_Trace( "%s( Instance=%p, Value=%p )", __FUNCTION__, Instance, Value );

        Status = GPIO_STM32L496VGT6P_Instance_Read( Instance, Value );
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Variable(s) #####################################################
// #############################################################################

const char GPIO_STM32L496VGT6P_VERSION[] = "0.0.0.v20260412-1852";

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#endif /* STM32L496xx */

// #############################################################################
// #### END OF FILE ############################################################
// #############################################################################
